import random #کتاب خانه ها
import time
import arabic_reshaper
from bidi.algorithm import get_display
def farsi_text(text):#متن فارسی
    return get_display(arabic_reshaper.reshape(text))
                       
i = 0
time.sleep(0.5)
print(farsi_text('می خواهی فشاری بشی😡'))
print('')
time.sleep(2)
print(farsi_text(' در این بازی شما باید شانس خود را امتحان کنید 🎃 \n(قوانین: شما باید سه تا عدد از یک تا صد انتخاب کنید و سپس باید  ببینید که آن عدد هایی  که انتخاب کرده اید \n با آن یک عددی که دستگاه برای شما در بازی از یک تا صد یک عدد ارسال میکند مساوی است یانه  موفق باشید✨🧨رفیق'))#قوانین بازی
while True:#بازی
    print('')
    time.sleep(1.50)
    print(farsi_text('😎😍اگر هر سه تا عدد مساوی با عدد دست گاه باشد شما یک امتیاز در یافت می کنی'))
    print('')
    a = int(input(farsi_text(':اولین عدد🧨 ')))
    print('')
    b = int(input(farsi_text(':دومین عدد🧨 ')))
    print('')
    c = int(input(farsi_text(':سومین عدد🧨 ')))
    print('')
    

    print(farsi_text('درحال ارسال عدد...🧐'))#ارسال عدد 
    time.sleep(3)
    d = random.randint(1,100)

    print('')
    print(farsi_text(f'🎯 عدد دستگاه: {d}'))
    print('')
    time.sleep(1)
    if a == d: print(farsi_text('اولین عدد موفق🎉🎉🎉\n \n'))#برسی عدد کاربر
    else: print(farsi_text("اولین عدد اشتباه بود😨\n \n"))

    time.sleep(1)
    if b == d: print(farsi_text('دومین عدد موفق🎉🎉🎉\n \n'))
    else: print(farsi_text('دومین عدد اشتباه بود😨\n \n'))

    time.sleep(1)
    if c == d: print(farsi_text('سومین عدد موفق🎉🎉🎉\n \n'))
    else: print(farsi_text('سومین عدد اشتباه بود😨\n \n'))
    if a == d: 
        i += 1

    if b == d: 
        i += 1
        
    if c == d: 
        i += 1

    k = int(input(farsi_text(': برای دیدن امتیاز عدد1 را بنویید🧨')))
    if k == 1:
        print(farsi_text(f'امتیاز شما:{i}'))
    else: 
        print(farsi_text('لطفا فقط عدد  1  را وارد کنید '))
    

    w = input(farsi_text(':برای پایان بازی کلمه   پایان   را وارد کنید ار هم نمی خواهید اینتر را فشار دهید'))
    if w == 'پایان': break





    






